/************************************
***********易思达FPGA实验*************             
**软    件：GOwin云源软件              
**项    目：动态数码管控制模块                
**时    钟：50MHz                     
**板卡型号：GW1N-UV9EQ144C6I5          
*************************************/  
module  seg_ctrl(
    input                clk_50m   ,//时钟输入
    input                rst_n     ,//复位输入
    input       [15:0]   data_in   ,//显示数据
    output reg  [3:0]    sel       ,//数码管位选
    output reg  [7:0]    seg        //数码管段选
    );
//参数定义

localparam  zero  = 7'b1000000 ,//0
            one   = 7'b1111001 ,//1
            two   = 7'b0100100 ,//2
            three = 7'b0110000 ,//3
            four  = 7'b0011001 ,//4
            five  = 7'b0010010 ,//5
            six   = 7'b0000010 ,//6
            seven = 7'b1111000 ,//7
            eight = 7'b0000000 ,//8
            nine  = 7'b0010000 ,//9
            sign_m= 7'b0111111 ;//小数点
//信号定义


//在此处编写代码


endmodule

